Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
 + tags_all               = {
10:05:21.424 STDOUT terraform1.10.5:           + "Environment" = "t1"
10:05:21.424 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
10:05:21.424 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
10:05:21.424 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
10:05:21.424 STDOUT terraform1.10.5:         }
10:05:21.424 STDOUT terraform1.10.5:       + update_default_version = true
10:05:21.424 STDOUT terraform1.10.5:       + user_data              = "IyEvYmluL2Jhc2gKCmNhdCA8PCdFT0YnID4+IC9ldGMvZWNzL2Vjcy5jb25maWcKRUNTX0NMVVNURVI9dDEtc2tlbGV0b24tZXUtY2VudHJhbC0xLW15Y2x1c3RlcjUKRUNTX0xPR0xFVkVMPWRlYnVnCkVDU19DT05UQUlORVJfSU5TVEFOQ0VfVEFHUz17IkVudmlyb25tZW50IjoidDEiLCJOYW1lIjoidDEtc2tlbGV0b24tZXUtY2VudHJhbC0xLW15Y2x1c3RlcjUiLCJOYW1lc3BhY2UiOiJza2VsZXRvbiIsIlJlZ2lvbiI6ImV1LWNlbnRyYWwtMSJ9CkVDU19FTkFCTEVfVEFTS19JQU1fUk9MRT10cnVlCkVPRgoK"
10:05:21.425 STDOUT terraform1.10.5:       + vpc_security_group_ids = (known after apply)
10:05:21.425 STDOUT terraform1.10.5:       + iam_instance_profile (known after apply)
10:05:21.425 STDOUT terraform1.10.5:       + metadata_options (known after apply)
10:05:21.425 STDOUT terraform1.10.5:       + monitoring {
10:05:21.425 STDOUT terraform1.10.5:           + enabled = true
10:05:21.425 STDOUT terraform1.10.5:         }
10:05:21.425 STDOUT terraform1.10.5:     }
10:05:21.425 STDOUT terraform1.10.5:   # module.autoscaling_sg.aws_security_group.this[0] will be created
10:05:21.425 STDOUT terraform1.10.5:   + resource "aws_security_group" "this" {
10:05:21.425 STDOUT terraform1.10.5:       + arn                    = (known after apply)
10:05:21.425 STDOUT terraform1.10.5:       + description            = "Autoscaling group security group for t1-skeleton-eu-central-1-mycluster5"
10:05:21.425 STDOUT terraform1.10.5:       + egress                 = (known after apply)
10:05:21.425 STDOUT terraform1.10.5:       + id                     = (known after apply)
10:05:21.425 STDOUT terraform1.10.5:       + ingress                = (known after apply)
10:05:21.425 STDOUT terraform1.10.5:       + name                   = "t1-skeleton-eu-central-1-mycluster5-asg-sg"
10:05:21.425 STDOUT terraform1.10.5:       + name_prefix            = (known after apply)
10:05:21.431 STDOUT terraform1.10.5:       + owner_id               = (known after apply)
10:05:21.431 STDOUT terraform1.10.5:       + revoke_rules_on_delete = false
10:05:21.431 STDOUT terraform1.10.5:       + tags                   = {
10:05:21.431 STDOUT terraform1.10.5:           + "Environment" = "t1"
10:05:21.431 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
10:05:21.431 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
10:05:21.431 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
10:05:21.431 STDOUT terraform1.10.5:         }
10:05:21.431 STDOUT terraform1.10.5:       + tags_all               = {
10:05:21.432 STDOUT terraform1.10.5:           + "Environment" = "t1"
10:05:21.432 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
10:05:21.432 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
10:05:21.432 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
10:05:21.432 STDOUT terraform1.10.5:         }
10:05:21.432 STDOUT terraform1.10.5:       + vpc_id                 = "vpc-12345678"
10:05:21.432 STDOUT terraform1.10.5:       + timeouts {
10:05:21.432 STDOUT terraform1.10.5:           + create = "10m"
10:05:21.432 STDOUT terraform1.10.5:           + delete = "15m"
10:05:21.432 STDOUT terraform1.10.5:         }
10:05:21.432 STDOUT terraform1.10.5:     }
10:05:21.432 STDOUT terraform1.10.5:   # module.autoscaling_sg.aws_security_group_rule.egress_rules[0] will be created
10:05:21.432 STDOUT terraform1.10.5:   + resource "aws_security_group_rule" "egress_rules" {
10:05:21.432 STDOUT terraform1.10.5:       + cidr_blocks              = [
10:05:21.432 STDOUT terraform1.10.5:           + "0.0.0.0/0",
10:05:21.432 STDOUT terraform1.10.5:         ]
10:05:21.432 STDOUT terraform1.10.5:       + description              = "All protocols"
10:05:21.432 STDOUT terraform1.10.5:       + from_port                = -1
10:05:21.432 STDOUT terraform1.10.5:       + id                       = (known after apply)
10:05:21.432 STDOUT terraform1.10.5:       + ipv6_cidr_blocks         = [
10:05:21.432 STDOUT terraform1.10.5:           + "::/0",
10:05:21.432 STDOUT terraform1.10.5:         ]
10:05:21.432 STDOUT terraform1.10.5:       + prefix_list_ids          = []
10:05:21.432 STDOUT terraform1.10.5:       + protocol                 = "-1"
10:05:21.433 STDOUT terraform1.10.5:       + security_group_id        = (known after apply)
10:05:21.433 STDOUT terraform1.10.5:       + security_group_rule_id   = (known after apply)
10:05:21.433 STDOUT terraform1.10.5:       + self                     = false
10:05:21.433 STDOUT terraform1.10.5:       + source_security_group_id = (known after apply)
10:05:21.433 STDOUT terraform1.10.5:       + to_port                  = -1
10:05:21.433 STDOUT terraform1.10.5:       + type                     = "egress"
10:05:21.433 STDOUT terraform1.10.5:     }
10:05:21.433 STDOUT terraform1.10.5:   # module.ecs_cluster.aws_cloudwatch_log_group.this[0] will be created
10:05:21.433 STDOUT terraform1.10.5:   + resource "aws_cloudwatch_log_group" "this" {
10:05:21.433 STDOUT terraform1.10.5:       + arn               = (known after apply)
10:05:21.433 STDOUT terraform1.10.5:       + id                = (known after apply)
10:05:21.433 STDOUT terraform1.10.5:       + log_group_class   = (known after apply)
10:05:21.433 STDOUT terraform1.10.5:       + name              = "/aws/ecs/t1-skeleton-eu-central-1-mycluster5"
10:05:21.433 STDOUT terraform1.10.5:       + name_prefix       = (known after apply)
10:05:21.433 STDOUT terraform1.10.5:       + retention_in_days = 90
10:05:21.433 STDOUT terraform1.10.5:       + skip_destroy      = false
10:05:21.433 STDOUT terraform1.10.5:       + tags              = {
10:05:21.433 STDOUT terraform1.10.5:           + "Environment" = "t1"
10:05:21.433 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
10:05:21.433 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
10:05:21.433 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
10:05:21.434 STDOUT terraform1.10.5:         }
10:05:21.434 STDOUT terraform1.10.5:       + tags_all          = {
10:05:21.434 STDOUT terraform1.10.5:           + "Environment" = "t1"
10:05:21.434 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
10:05:21.434 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
10:05:21.434 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
10:05:21.434 STDOUT terraform1.10.5:         }
10:05:21.434 STDOUT terraform1.10.5:     }
10:05:21.434 STDOUT terraform1.10.5:   # module.ecs_cluster.aws_ecs_capacity_provider.this["on-demand"] will be created
10:05:21.434 STDOUT terraform1.10.5:   + resource "aws_ecs_capacity_provider" "this" {
10:05:21.434 STDOUT terraform1.10.5:       + arn      = (known after apply)
10:05:21.434 STDOUT terraform1.10.5:       + id       = (known after apply)
10:05:21.434 STDOUT terraform1.10.5:       + name     = "t1-skeleton-eu-central-1-mycluster5-on-demand"
10:05:21.434 STDOUT terraform1.10.5:       + tags     = {
10:05:21.434 STDOUT terraform1.10.5:           + "Environment" = "t1"
10:05:21.434 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
10:05:21.434 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
10:05:21.434 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
10:05:21.434 STDOUT terraform1.10.5:         }
10:05:21.434 STDOUT terraform1.10.5:       + tags_all = {
10:05:21.434 STDOUT terraform1.10.5:           + "Environment" = "t1"
10:05:21.434 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
10:05:21.434 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
10:05:21.434 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
10:05:21.434 STDOUT terraform1.10.5:         }
10:05:21.434 STDOUT terraform1.10.5:       + auto_scaling_group_provider {
10:05:21.434 STDOUT terraform1.10.5:           + auto_scaling_group_arn         = (known after apply)
10:05:21.435 STDOUT terraform1.10.5:           + managed_draining               = (known after apply)
10:05:21.435 STDOUT terraform1.10.5:           + managed_termination_protection = "ENABLED"
10:05:21.435 STDOUT terraform1.10.5:           + managed_scaling {
10:05:21.435 STDOUT terraform1.10.5:               + instance_warmup_period    = (known after apply)
10:05:21.435 STDOUT terraform1.10.5:               + maximum_scaling_step_size = 5
10:05:21.435 STDOUT terraform1.10.5:               + minimum_scaling_step_size = 1
10:05:21.435 STDOUT terraform1.10.5:               + status                    = "ENABLED"
10:05:21.435 STDOUT terraform1.10.5:               + target_capacity           = 60
10:05:21.435 STDOUT terraform1.10.5:             }
10:05:21.435 STDOUT terraform1.10.5:         }
10:05:21.435 STDOUT terraform1.10.5:     }
10:05:21.435 STDOUT terraform1.10.5:   # module.ecs_cluster.aws_ecs_cluster.this[0] will be created
10:05:21.435 STDOUT terraform1.10.5:   + resource "aws_ecs_cluster" "this" {
10:05:21.435 STDOUT terraform1.10.5:       + arn      = (known after apply)
10:05:21.435 STDOUT terraform1.10.5:       + id       = (known after apply)
10:05:21.435 STDOUT terraform1.10.5:       + name     = "t1-skeleton-eu-central-1-mycluster5"
10:05:21.435 STDOUT terraform1.10.5:       + tags     = {
10:05:21.435 STDOUT terraform1.10.5:           + "Environment" = "t1"
10:05:21.435 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
10:05:21.435 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
10:05:21.435 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
10:05:21.435 STDOUT terraform1.10.5:         }
10:05:21.435 STDOUT terraform1.10.5:       + tags_all = {
10:05:21.435 STDOUT terraform1.10.5:           + "Environment" = "t1"
10:05:21.435 STDOUT terraform1.10.5:           + "Name"        = "t1-skeleton-eu-central-1-mycluster5"
10:05:21.435 STDOUT terraform1.10.5:           + "Namespace"   = "skeleton"
10:05:21.513 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
10:05:21.513 STDOUT terraform1.10.5:         }
10:05:21.513 STDOUT terraform1.10.5:       + configuration {
10:05:21.513 STDOUT terraform1.10.5:           + execute_command_configuration {
10:05:21.513 STDOUT terraform1.10.5:               + logging = "DEFAULT"
10:05:21.513 STDOUT terraform1.10.5:             }
10:05:21.513 STDOUT terraform1.10.5:         }
10:05:21.513 STDOUT terraform1.10.5:       + setting {
10:05:21.513 STDOUT terraform1.10.5:           + name  = "containerInsights"
10:05:21.513 STDOUT terraform1.10.5:           + value = "enabled"
10:05:21.513 STDOUT terraform1.10.5:         }
10:05:21.513 STDOUT terraform1.10.5:     }
10:05:21.513 STDOUT terraform1.10.5:   # module.ecs_cluster.aws_ecs_cluster_capacity_providers.this[0] will be created
10:05:21.513 STDOUT terraform1.10.5:   + resource "aws_ecs_cluster_capacity_providers" "this" {
10:05:21.513 STDOUT terraform1.10.5:       + capacity_providers = [
10:05:21.513 STDOUT terraform1.10.5:           + "t1-skeleton-eu-central-1-mycluster5-on-demand",
10:05:21.513 STDOUT terraform1.10.5:         ]
10:05:21.513 STDOUT terraform1.10.5:       + cluster_name       = "t1-skeleton-eu-central-1-mycluster5"
10:05:21.513 STDOUT terraform1.10.5:       + id                 = (known after apply)
10:05:21.513 STDOUT terraform1.10.5:       + default_capacity_provider_strategy {
10:05:21.513 STDOUT terraform1.10.5:           + base              = 20
10:05:21.513 STDOUT terraform1.10.5:           + capacity_provider = "t1-skeleton-eu-central-1-mycluster5-on-demand"
10:05:21.513 STDOUT terraform1.10.5:           + weight            = 60
10:05:21.514 STDOUT terraform1.10.5:         }
10:05:21.514 STDOUT terraform1.10.5:     }
10:05:21.514 STDOUT terraform1.10.5: Plan: 12 to add, 0 to change, 0 to destroy.
10:05:21.514 STDOUT terraform1.10.5: 
10:05:21.514 STDOUT terraform1.10.5: Changes to Outputs:
10:05:21.514 STDOUT terraform1.10.5:   + cluster_arn                            = (known after apply)
10:05:21.514 STDOUT terraform1.10.5:   + cluster_autoscaling_capacity_providers = {
10:05:21.514 STDOUT terraform1.10.5:       + on-demand = {
10:05:21.514 STDOUT terraform1.10.5:           + arn                         = (known after apply)
10:05:21.514 STDOUT terraform1.10.5:           + auto_scaling_group_provider = [
10:05:21.514 STDOUT terraform1.10.5:               + {
10:05:21.514 STDOUT terraform1.10.5:                   + auto_scaling_group_arn         = (known after apply)
10:05:21.514 STDOUT terraform1.10.5:                   + managed_draining               = (known after apply)
10:05:21.514 STDOUT terraform1.10.5:                   + managed_scaling                = [
10:05:21.514 STDOUT terraform1.10.5:                       + {
10:05:21.514 STDOUT terraform1.10.5:                           + instance_warmup_period    = (known after apply)
10:05:21.514 STDOUT terraform1.10.5:                           + maximum_scaling_step_size = 5
10:05:21.514 STDOUT terraform1.10.5:                           + minimum_scaling_step_size = 1
10:05:21.514 STDOUT terraform1.10.5:                           + status                    = "ENABLED"
10:05:21.514 STDOUT terraform1.10.5:                           + target_capacity           = 60
10:05:21.514 STDOUT terraform1.10.5:                         },
10:05:21.514 STDOUT terraform1.10.5:                     ]
10:05:21.514 STDOUT terraform1.10.5:                   + managed_termination_protection = "ENABLED"
10:05:21.514 STDOUT terraform1.10.5:                 },
10:05:21.514 STDOUT terraform1.10.5:             ]
10:05:21.514 STDOUT terraform1.10.5:           + id                          = (known after apply)
10:05:21.514 STDOUT terraform1.10.5:           + name                        = "t1-skeleton-eu-central-1-mycluster5-on-demand"
10:05:21.515 STDOUT terraform1.10.5:           + tags                        = {
10:05:21.515 STDOUT terraform1.10.5:               + Environment = "t1"
10:05:21.515 STDOUT terraform1.10.5:               + Name        = "t1-skeleton-eu-central-1-mycluster5"
10:05:21.515 STDOUT terraform1.10.5:               + Namespace   = "skeleton"
10:05:21.515 STDOUT terraform1.10.5:               + Region      = "eu-central-1"
10:05:21.515 STDOUT terraform1.10.5:             }
10:05:21.515 STDOUT terraform1.10.5:           + tags_all                    = {
10:05:21.515 STDOUT terraform1.10.5:               + Environment = "t1"
10:05:21.515 STDOUT terraform1.10.5:               + Name        = "t1-skeleton-eu-central-1-mycluster5"
10:05:21.515 STDOUT terraform1.10.5:               + Namespace   = "skeleton"
10:05:21.515 STDOUT terraform1.10.5:               + Region      = "eu-central-1"
10:05:21.515 STDOUT terraform1.10.5:             }
10:05:21.515 STDOUT terraform1.10.5:         }
10:05:21.515 STDOUT terraform1.10.5:     }
10:05:21.515 STDOUT terraform1.10.5:   + cluster_capacity_providers             = (known after apply)
10:05:21.515 STDOUT terraform1.10.5:   + cluster_id                             = (known after apply)
10:05:21.515 STDOUT terraform1.10.5:   + cluster_name                           = "t1-skeleton-eu-central-1-mycluster5"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d devops-dev/t1/eu-central-1/skeleton/ecs_clusters/mycluster5 -w devops-dev_t1_eu-central-1_skeleton_ecs_clusters_mycluster5
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://global-common-eu-central-1-atlantis.skeleton-dev.testenv.io/lock?id=cryptocat-org%252Fdevops-digger%252Fdevops-dev%252Ft1%252Feu-central-1%252Fskeleton%252Fecs_clusters%252Fmycluster5%252Fdevops-dev_t1_eu-central-1_skeleton_ecs_clusters_mycluster5)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d devops-dev/t1/eu-central-1/skeleton/ecs_clusters/mycluster5 -w devops-dev_t1_eu-central-1_skeleton_ecs_clusters_mycluster5
  ```
Plan: 12 to add, 0 to change, 0 to destroy.

---
### 2. dir: `devops-dev/global/eu-central-1/common/vpc/dev3` workspace: `devops-dev_global_eu-central-1_common_vpc_dev3`
<details><summary>Show Output</summary>

```diff
10:04:54.334 WARN   The `TERRAGRUNT_TFPATH` environment variable is deprecated and will be removed in a future version of Terragrunt. Use `TG_TF_PATH=terraform1.10.5` instead.
10:05:22.624 STDOUT terraform1.10.5: Terraform used the selected providers to generate the following execution
10:05:22.625 STDOUT terraform1.10.5: plan. Resource actions are indicated with the following symbols:
10:05:22.625 STDOUT terraform1.10.5:   + create
10:05:22.625 STDOUT terraform1.10.5: Terraform will perform the following actions:
10:05:22.625 STDOUT terraform1.10.5:   # module.vpc.aws_default_network_acl.this[0] will be created
10:05:22.625 STDOUT terraform1.10.5:   + resource "aws_default_network_acl" "this" {
10:05:22.625 STDOUT terraform1.10.5:       + arn                    = (known after apply)
10:05:22.625 STDOUT terraform1.10.5:       + default_network_acl_id = (known after apply)
10:05:22.625 STDOUT terraform1.10.5:       + id                     = (known after apply)
10:05:22.625 STDOUT terraform1.10.5:       + owner_id               = (known after apply)
10:05:22.625 STDOUT terraform1.10.5:       + tags                   = {
10:05:22.625 STDOUT terraform1.10.5:           + "Environment" = "global"
10:05:22.625 STDOUT terraform1.10.5:           + "Name"        = "global-common-eu-central-1-dev3"
10:05:22.625 STDOUT terraform1.10.5:           + "Namespace"   = "common"
10:05:22.626 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
10:05:22.626 STDOUT terraform1.10.5:         }
10:05:22.626 STDOUT terraform1.10.5:       + tags_all               = {
10:05:22.626 STDOUT terraform1.10.5:           + "Environment" = "global"
10:05:22.626 STDOUT terraform1.10.5:           + "Name"        = "global-common-eu-central-1-dev3"
10:05:22.626 STDOUT terraform1.10.5:           + "Namespace"   = "common"
10:05:22.626 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
10:05:22.626 STDOUT terraform1.10.5:         }
10:05:22.626 STDOUT terraform1.10.5:       + vpc_id                 = (known after apply)
10:05:22.626 STDOUT terraform1.10.5:       + egress {
10:05:22.626 STDOUT terraform1.10.5:           + action          = "allow"
10:05:22.626 STDOUT terraform1.10.5:           + from_port       = 0
10:05:22.626 STDOUT terraform1.10.5:           + ipv6_cidr_block = "::/0"
10:05:22.626 STDOUT terraform1.10.5:           + protocol        = "-1"
10:05:22.626 STDOUT terraform1.10.5:           + rule_no         = 101
10:05:22.626 STDOUT terraform1.10.5:           + to_port         = 0
10:05:22.626 STDOUT terraform1.10.5:             # (1 unchanged attribute hidden)
10:05:22.626 STDOUT terraform1.10.5:         }
10:05:22.626 STDOUT terraform1.10.5:       + egress {
10:05:22.626 STDOUT terraform1.10.5:           + action          = "allow"
10:05:22.626 STDOUT terraform1.10.5:           + cidr_block      = "0.0.0.0/0"
10:05:22.627 STDOUT terraform1.10.5:           + from_port       = 0
10:05:22.627 STDOUT terraform1.10.5:           + protocol        = "-1"
10:05:22.627 STDOUT terraform1.10.5:           + rule_no         = 100
10:05:22.627 STDOUT terraform1.10.5:           + to_port         = 0
10:05:22.627 STDOUT terraform1.10.5:             # (1 unchanged attribute hidden)
10:05:22.627 STDOUT terraform1.10.5:         }
10:05:22.627 STDOUT terraform1.10.5:       + ingress {
10:05:22.627 STDOUT terraform1.10.5:           + action          = "allow"
10:05:22.627 STDOUT terraform1.10.5:           + from_port       = 0
10:05:22.627 STDOUT terraform1.10.5:           + ipv6_cidr_block = "::/0"
10:05:22.627 STDOUT terraform1.10.5:           + protocol        = "-1"
10:05:22.627 STDOUT terraform1.10.5:           + rule_no         = 101
10:05:22.627 STDOUT terraform1.10.5:           + to_port         = 0
10:05:22.627 STDOUT terraform1.10.5:             # (1 unchanged attribute hidden)
10:05:22.627 STDOUT terraform1.10.5:         }
10:05:22.627 STDOUT terraform1.10.5:       + ingress {
10:05:22.627 STDOUT terraform1.10.5:           + action          = "allow"
10:05:22.627 STDOUT terraform1.10.5:           + cidr_block      = "0.0.0.0/0"
10:05:22.627 STDOUT terraform1.10.5:           + from_port       = 0
10:05:22.627 STDOUT terraform1.10.5:           + protocol        = "-1"
10:05:22.627 STDOUT terraform1.10.5:           + rule_no         = 100
10:05:22.628 STDOUT terraform1.10.5:           + to_port         = 0
10:05:22.628 STDOUT terraform1.10.5:             # (1 unchanged attribute hidden)
10:05:22.628 STDOUT terraform1.10.5:         }
10:05:22.628 STDOUT terraform1.10.5:     }
10:05:22.628 STDOUT terraform1.10.5:   # module.vpc.aws_default_route_table.default[0] will be created
10:05:22.628 STDOUT terraform1.10.5:   + resource "aws_default_route_table" "default" {
10:05:22.628 STDOUT terraform1.10.5:       + arn                    = (known after apply)
10:05:22.628 STDOUT terraform1.10.5:       + default_route_table_id = (known after apply)
10:05:22.628 STDOUT terraform1.10.5:       + id                     = (known after apply)
10:05:22.628 STDOUT terraform1.10.5:       + owner_id               = (known after apply)
10:05:22.628 STDOUT terraform1.10.5:       + route                  = (known after apply)
10:05:22.628 STDOUT terraform1.10.5:       + tags                   = {
10:05:22.628 STDOUT terraform1.10.5:           + "Environment" = "global"
10:05:22.629 STDOUT terraform1.10.5:           + "Name"        = "global-common-eu-central-1-dev3"
10:05:22.629 STDOUT terraform1.10.5:           + "Namespace"   = "common"
10:05:22.629 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
10:05:22.629 STDOUT terraform1.10.5:         }
10:05:22.629 STDOUT terraform1.10.5:       + tags_all               = {
10:05:22.629 STDOUT terraform1.10.5:           + "Environment" = "global"
10:05:22.629 STDOUT terraform1.10.5:           + "Name"        = "global-common-eu-central-1-dev3"
10:05:22.629 STDOUT terraform1.10.5:           + "Namespace"   = "common"
10:05:22.630 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
10:05:22.630 STDOUT terraform1.10.5:         }
10:05:22.630 STDOUT terraform1.10.5:       + vpc_id                 = (known after apply)
10:05:22.630 STDOUT terraform1.10.5:       + timeouts {
10:05:22.630 STDOUT terraform1.10.5:           + create = "5m"
10:05:22.630 STDOUT terraform1.10.5:           + update = "5m"
10:05:22.630 STDOUT terraform1.10.5:         }
10:05:22.630 STDOUT terraform1.10.5:     }
10:05:22.630 STDOUT terraform1.10.5:   # module.vpc.aws_default_security_group.this[0] will be created
10:05:22.630 STDOUT terraform1.10.5:   + resource "aws_default_security_group" "this" {
10:05:22.630 STDOUT terraform1.10.5:       + arn                    = (known after apply)
10:05:22.630 STDOUT terraform1.10.5:       + description            = (known after apply)
10:05:22.630 STDOUT terraform1.10.5:       + egress                 = (known after apply)
10:05:22.630 STDOUT terraform1.10.5:       + id                     = (known after apply)
10:05:22.630 STDOUT terraform1.10.5:       + ingress                = (known after apply)
10:05:22.631 STDOUT terraform1.10.5:       + name                   = (known after apply)
10:05:22.631 STDOUT terraform1.10.5:       + name_prefix            = (known after apply)
10:05:22.631 STDOUT terraform1.10.5:       + owner_id               = (known after apply)
10:05:22.631 STDOUT terraform1.10.5:       + revoke_rules_on_delete = false
10:05:22.631 STDOUT terraform1.10.5:       + tags                   = {
10:05:22.631 STDOUT terraform1.10.5:           + "Environment" = "global"
10:05:22.631 STDOUT terraform1.10.5:           + "Name"        = "global-common-eu-central-1-dev3"
10:05:22.631 STDOUT terraform1.10.5:           + "Namespace"   = "common"
10:05:22.631 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
10:05:22.631 STDOUT terraform1.10.5:         }
10:05:22.631 STDOUT terraform1.10.5:       + tags_all               = {
10:05:22.631 STDOUT terraform1.10.5:           + "Environment" = "global"
10:05:22.631 STDOUT terraform1.10.5:           + "Name"        = "global-common-eu-central-1-dev3"
10:05:22.631 STDOUT terraform1.10.5:           + "Namespace"   = "common"
10:05:22.632 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
10:05:22.632 STDOUT terraform1.10.5:         }
10:05:22.632 STDOUT terraform1.10.5:       + vpc_id                 = (known after apply)
10:05:22.632 STDOUT terraform1.10.5:     }
10:05:22.632 STDOUT terraform1.10.5:   # module.vpc.aws_eip.nat[0] will be created
10:05:22.632 STDOUT terraform1.10.5:   + resource "aws_eip" "nat" {
10:05:22.641 STDOUT terraform1.10.5:       + allocation_id        = (known after apply)
10:05:22.641 STDOUT terraform1.10.5:       + arn                  = (known after apply)
10:05:22.641 STDOUT terraform1.10.5:       + association_id       = (known after apply)
10:05:22.641 STDOUT terraform1.10.5:       + carrier_ip           = (known after apply)
10:05:22.641 STDOUT terraform1.10.5:       + customer_owned_ip    = (known after apply)
10:05:22.641 STDOUT terraform1.10.5:       + domain               = "vpc"
10:05:22.642 STDOUT terraform1.10.5:       + id                   = (known after apply)
10:05:22.642 STDOUT terraform1.10.5:       + instance             = (known after apply)
10:05:22.642 STDOUT terraform1.10.5:       + ipam_pool_id         = (known after apply)
10:05:22.642 STDOUT terraform1.10.5:       + network_border_group = (known after apply)
10:05:22.642 STDOUT terraform1.10.5:       + network_interface    = (known after apply)
10:05:22.642 STDOUT terraform1.10.5:       + private_dns          = (known after apply)
10:05:22.642 STDOUT terraform1.10.5:       + private_ip           = (known after apply)
10:05:22.642 STDOUT terraform1.10.5:       + ptr_record           = (known after apply)
10:05:22.642 STDOUT terraform1.10.5:       + public_dns           = (known after apply)
10:05:22.643 STDOUT terraform1.10.5:       + public_ip            = (known after apply)
10:05:22.643 STDOUT terraform1.10.5:       + public_ipv4_pool     = (known after apply)
10:05:22.643 STDOUT terraform1.10.5:       + tags                 = {
10:05:22.643 STDOUT terraform1.10.5:           + "Environment" = "global"
10:05:22.643 STDOUT terraform1.10.5:           + "Name"        = "global-common-eu-central-1-dev3"
10:05:22.643 STDOUT terraform1.10.5:           + "Namespace"   = "common"
10:05:22.643 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
10:05:22.643 STDOUT terraform1.10.5:         }
10:05:22.643 STDOUT terraform1.10.5:       + tags_all             = {
10:05:22.643 STDOUT terraform1.10.5:           + "Environment" = "global"
10:05:22.644 STDOUT terraform1.10.5:           + "Name"        = "global-common-eu-central-1-dev3"
10:05:22.644 STDOUT terraform1.10.5:           + "Namespace"   = "common"
10:05:22.644 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
10:05:22.644 STDOUT terraform1.10.5:         }
10:05:22.644 STDOUT terraform1.10.5:       + vpc                  = (known after apply)
10:05:22.644 STDOUT terraform1.10.5:     }
10:05:22.644 STDOUT terraform1.10.5:   # module.vpc.aws_internet_gateway.this[0] will be created
10:05:22.644 STDOUT terraform1.10.5:   + resource "aws_internet_gateway" "this" {
10:05:22.644 STDOUT terraform1.10.5:       + arn      = (known after apply)
10:05:22.644 STDOUT terraform1.10.5:       + id       = (known after apply)
10:05:22.645 STDOUT terraform1.10.5:       + owner_id = (known after apply)
10:05:22.645 STDOUT terraform1.10.5:       + tags     = {
10:05:22.645 STDOUT terraform1.10.5:           + "Environment" = "global"
10:05:22.645 STDOUT terraform1.10.5:           + "Name"        = "global-common-eu-central-1-dev3"
10:05:22.645 STDOUT terraform1.10.5:           + "Namespace"   = "common"
10:05:22.645 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
10:05:22.645 STDOUT terraform1.10.5:         }
10:05:22.645 STDOUT terraform1.10.5:       + tags_all = {
10:05:22.645 STDOUT terraform1.10.5:           + "Environment" = "global"
10:05:22.645 STDOUT terraform1.10.5:           + "Name"        = "global-common-eu-central-1-dev3"
10:05:22.645 STDOUT terraform1.10.5:           + "Namespace"   = "common"
10:05:22.645 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
10:05:22.645 STDOUT terraform1.10.5:         }
10:05:22.645 STDOUT terraform1.10.5:       + vpc_id   = (known after apply)
10:05:22.645 STDOUT terraform1.10.5:     }
10:05:22.645 STDOUT terraform1.10.5:   # module.vpc.aws_nat_gateway.this[0] will be created
10:05:22.646 STDOUT terraform1.10.5:   + resource "aws_nat_gateway" "this" {
10:05:22.646 STDOUT terraform1.10.5:       + allocation_id                      = (known after apply)
10:05:22.646 STDOUT terraform1.10.5:       + association_id                     = (known after apply)
10:05:22.646 STDOUT terraform1.10.5:       + connectivity_type                  = "public"
10:05:22.646 STDOUT terraform1.10.5:       + id                                 = (known after apply)
10:05:22.646 STDOUT terraform1.10.5:       + network_interface_id               = (known after apply)
10:05:22.646 STDOUT terraform1.10.5:       + private_ip                         = (known after apply)
10:05:22.646 STDOUT terraform1.10.5:       + public_ip                          = (known after apply)
10:05:22.646 STDOUT terraform1.10.5:       + secondary_private_ip_address_count = (known after apply)
10:05:22.646 STDOUT terraform1.10.5:       + secondary_private_ip_addresses     = (known after apply)
10:05:22.646 STDOUT terraform1.10.5:       + subnet_id                          = (known after apply)
10:05:22.646 STDOUT terraform1.10.5:       + tags                               = {
10:05:22.646 STDOUT terraform1.10.5:           + "Environment" = "global"
10:05:22.646 STDOUT terraform1.10.5:           + "Name"        = "global-common-eu-central-1-dev3"
10:05:22.646 STDOUT terraform1.10.5:           + "Namespace"   = "common"
10:05:22.646 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
10:05:22.646 STDOUT terraform1.10.5:         }
10:05:22.646 STDOUT terraform1.10.5:       + tags_all                           = {
10:05:22.646 STDOUT terraform1.10.5:           + "Environment" = "global"
10:05:22.647 STDOUT terraform1.10.5:           + "Name"        = "global-common-eu-central-1-dev3"
10:05:22.647 STDOUT terraform1.10.5:           + "Namespace"   = "common"
10:05:22.647 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
10:05:22.647 STDOUT terraform1.10.5:         }
10:05:22.647 STDOUT terraform1.10.5:     }
10:05:22.647 STDOUT terraform1.10.5:   # module.vpc.aws_route.private_nat_gateway[0] will be created
10:05:22.647 STDOUT terraform1.10.5:   + resource "aws_route" "private_nat_gateway" {
10:05:22.647 STDOUT terraform1.10.5:       + destination_cidr_block = "0.0.0.0/0"
10:05:22.647 STDOUT terraform1.10.5:       + id                     = (known after apply)
10:05:22.647 STDOUT terraform1.10.5:       + instance_id            = (known after apply)
10:05:22.647 STDOUT terraform1.10.5:       + instance_owner_id      = (known after apply)
10:05:22.647 STDOUT terraform1.10.5:       + nat_gateway_id         = (known after apply)
10:05:22.647 STDOUT terraform1.10.5:       + network_interface_id   = (known after apply)
10:05:22.647 STDOUT terraform1.10.5:       + origin                 = (known after apply)
10:05:22.647 STDOUT terraform1.10.5:       + route_table_id         = (known after apply)
10:05:22.647 STDOUT terraform1.10.5:       + state                  = (known after apply)
10:05:22.647 STDOUT terraform1.10.5:       + timeouts {
10:05:22.647 STDOUT terraform1.10.5:           + create = "5m"
10:05:22.647 STDOUT terraform1.10.5:         }
10:05:22.647 STDOUT terraform1.10.5:     }
10:05:22.647 STDOUT terraform1.10.5:   # module.vpc.aws_route.public_internet_gateway[0] will be created
10:05:22.647 STDOUT terraform1.10.5:   + resource "aws_route" "public_internet_gateway" {
10:05:22.647 STDOUT terraform1.10.5:       + destination_cidr_block = "0.0.0.0/0"
10:05:22.647 STDOUT terraform1.10.5:       + gateway_id             = (known after apply)
10:05:22.647 STDOUT terraform1.10.5:       + id                     = (known after apply)
10:05:22.647 STDOUT terraform1.10.5:       + instance_id            = (known after apply)
10:05:22.647 STDOUT terraform1.10.5:       + instance_owner_id      = (known after apply)
10:05:22.647 STDOUT terraform1.10.5:       + network_interface_id   = (known after apply)
10:05:22.647 STDOUT terraform1.10.5:       + origin                 = (known after apply)
10:05:22.647 STDOUT terraform1.10.5:       + route_table_id         = (known after apply)
10:05:22.647 STDOUT terraform1.10.5:       + state                  = (known after apply)
10:05:22.648 STDOUT terraform1.10.5:       + timeouts {
10:05:22.648 STDOUT terraform1.10.5:           + create = "5m"
10:05:22.648 STDOUT terraform1.10.5:         }
10:05:22.648 STDOUT terraform1.10.5:     }
10:05:22.648 STDOUT terraform1.10.5:   # module.vpc.aws_route_table.private[0] will be created
10:05:22.648 STDOUT terraform1.10.5:   + resource "aws_route_table" "private" {
10:05:22.648 STDOUT terraform1.10.5:       + arn              = (known after apply)
10:05:22.648 STDOUT terraform1.10.5:       + id               = (known after apply)
10:05:22.648 STDOUT terraform1.10.5:       + owner_id         = (known after apply)
10:05:22.648 STDOUT terraform1.10.5:       + propagating_vgws = (known after apply)
10:05:22.648 STDOUT terraform1.10.5:       + route            = (known after apply)
10:05:22.648 STDOUT terraform1.10.5:       + tags             = {
10:05:22.648 STDOUT terraform1.10.5:           + "Environment" = "global"
10:05:22.648 STDOUT terraform1.10.5:           + "Name"        = "global-common-eu-central-1-dev3"
10:05:22.648 STDOUT terraform1.10.5:           + "Namespace"   = "common"
10:05:22.648 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
10:05:22.648 STDOUT terraform1.10.5:         }
10:05:22.648 STDOUT terraform1.10.5:       + tags_all         = {
10:05:22.648 STDOUT terraform1.10.5:           + "Environment" = "global"
10:05:22.648 STDOUT terraform1.10.5:           + "Name"        = "global-common-eu-central-1-dev3"
10:05:22.648 STDOUT terraform1.10.5:           + "Namespace"   = "common"
10:05:22.648 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
10:05:22.648 STDOUT terraform1.10.5:         }
10:05:22.648 STDOUT terraform1.10.5:       + vpc_id           = (known after apply)
10:05:22.648 STDOUT terraform1.10.5:     }
10:05:22.648 STDOUT terraform1.10.5:   # module.vpc.aws_route_table.public[0] will be created
10:05:22.648 STDOUT terraform1.10.5:   + resource "aws_route_table" "public" {
10:05:22.648 STDOUT terraform1.10.5:       + arn              = (known after apply)
10:05:22.648 STDOUT terraform1.10.5:       + id               = (known after apply)
10:05:22.648 STDOUT terraform1.10.5:       + owner_id         = (known after apply)
10:05:22.648 STDOUT terraform1.10.5:       + propagating_vgws = (known after apply)
10:05:22.648 STDOUT terraform1.10.5:       + route            = (known after apply)
10:05:22.648 STDOUT terraform1.10.5:       + tags             = {
10:05:22.649 STDOUT terraform1.10.5:           + "Environment" = "global"
10:05:22.649 STDOUT terraform1.10.5:           + "Name"        = "global-common-eu-central-1-dev3"
10:05:22.649 STDOUT terraform1.10.5:           + "Namespace"   = "common"
10:05:22.649 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
10:05:22.649 STDOUT terraform1.10.5:         }
10:05:22.649 STDOUT terraform1.10.5:       + tags_all         = {
10:05:22.713 STDOUT terraform1.10.5:           + "Environment" = "global"
10:05:22.713 STDOUT terraform1.10.5:           + "Name"        = "global-common-eu-central-1-dev3"
10:05:22.713 STDOUT terraform1.10.5:           + "Namespace"   = "common"
10:05:22.713 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
10:05:22.713 STDOUT terraform1.10.5:         }
10:05:22.713 STDOUT terraform1.10.5:       + vpc_id           = (known after apply)
10:05:22.713 STDOUT terraform1.10.5:     }
10:05:22.713 STDOUT terraform1.10.5:   # module.vpc.aws_route_table_association.private[0] will be created
10:05:22.713 STDOUT terraform1.10.5:   + resource "aws_route_table_association" "private" {
10:05:22.713 STDOUT terraform1.10.5:       + id             = (known after apply)
10:05:22.713 STDOUT terraform1.10.5:       + route_table_id = (known after apply)
10:05:22.713 STDOUT terraform1.10.5:       + subnet_id      = (known after apply)
10:05:22.714 STDOUT terraform1.10.5:     }
10:05:22.714 STDOUT terraform1.10.5:   # module.vpc.aws_route_table_association.private[1] will be created
10:05:22.714 STDOUT terraform1.10.5:   + resource "aws_route_table_association" "private" {
10:05:22.714 STDOUT terraform1.10.5:       + id             = (known after apply)
10:05:22.714 STDOUT terraform1.10.5:       + route_table_id = (known after apply)
10:05:22.714 STDOUT terraform1.10.5:       + subnet_id      = (known after apply)
10:05:22.714 STDOUT terraform1.10.5:     }
10:05:22.714 STDOUT terraform1.10.5:   # module.vpc.aws_route_table_association.private[2] will be created
10:05:22.714 STDOUT terraform1.10.5:   + resource "aws_route_table_association" "private" {
10:05:22.714 STDOUT terraform1.10.5:       + id             = (known after apply)
10:05:22.714 STDOUT terraform1.10.5:       + route_table_id = (known after apply)
10:05:22.715 STDOUT terraform1.10.5:       + subnet_id      = (known after apply)
10:05:22.715 STDOUT terraform1.10.5:     }
10:05:22.715 STDOUT terraform1.10.5:   # module.vpc.aws_route_table_association.public[0] will be created
10:05:22.715 STDOUT terraform1.10.5:   + resource "aws_route_table_association" "public" {
10:05:22.715 STDOUT terraform1.10.5:       + id             = (known after apply)
10:05:22.715 STDOUT terraform1.10.5:       + route_table_id = (known after apply)
10:05:22.715 STDOUT terraform1.10.5:       + subnet_id      = (known after apply)
10:05:22.715 STDOUT terraform1.10.5:     }
10:05:22.715 STDOUT terraform1.10.5:   # module.vpc.aws_route_table_association.public[1] will be created
10:05:22.715 STDOUT terraform1.10.5:   + resource "aws_route_table_association" "public" {
10:05:22.715 STDOUT terraform1.10.5:       + id             = (known after apply)
10:05:22.715 STDOUT terraform1.10.5:       + route_table_id = (known after apply)
10:05:22.716 STDOUT terraform1.10.5:       + subnet_id      = (known after apply)
10:05:22.716 STDOUT terraform1.10.5:     }
10:05:22.716 STDOUT terraform1.10.5:   # module.vpc.aws_route_table_association.public[2] will be created
10:05:22.716 STDOUT terraform1.10.5:   + resource "aws_route_table_association" "public" {
10:05:22.716 STDOUT terraform1.10.5:       + id             = (known after apply)
10:05:22.716 STDOUT terraform1.10.5:       + route_table_id = (known after apply)
10:05:22.716 STDOUT terraform1.10.5:       + subnet_id      = (known after apply)
10:05:22.716 STDOUT terraform1.10.5:     }
10:05:22.716 STDOUT terraform1.10.5:   # module.vpc.aws_subnet.private[0] will be created
10:05:22.716 STDOUT terraform1.10.5:   + resource "aws_subnet" "private" {
10:05:22.716 STDOUT terraform1.10.5:       + arn                                            = (known after apply)
10:05:22.716 STDOUT terraform1.10.5:       + assign_ipv6_address_on_creation                = false
10:05:22.717 STDOUT terraform1.10.5:       + availability_zone                              = "eu-central-1a"
10:05:22.717 STDOUT terraform1.10.5:       + availability_zone_id                           = (known after apply)
10:05:22.717 STDOUT terraform1.10.5:       + cidr_block                                     = "10.10.0.0/20"
10:05:22.717 STDOUT terraform1.10.5:       + enable_dns64                                   = false
10:05:22.717 STDOUT terraform1.10.5:       + enable_resource_name_dns_a_record_on_launch    = false
10:05:22.717 STDOUT terraform1.10.5:       + enable_resource_name_dns_aaaa_record_on_launch = false
10:05:22.717 STDOUT terraform1.10.5:       + id                                             = (known after apply)
10:05:22.717 STDOUT terraform1.10.5:       + ipv6_cidr_block_association_id                 = (known after apply)
10:05:22.717 STDOUT terraform1.10.5:       + ipv6_native                                    = false
10:05:22.717 STDOUT terraform1.10.5:       + map_public_ip_on_launch                        = false
10:05:22.717 STDOUT terraform1.10.5:       + owner_id                                       = (known after apply)
10:05:22.717 STDOUT terraform1.10.5:       + private_dns_hostname_type_on_launch            = (known after apply)
10:05:22.718 STDOUT terraform1.10.5:       + tags                                           = {
10:05:22.718 STDOUT terraform1.10.5:           + "Environment"                     = "global"
10:05:22.718 STDOUT terraform1.10.5:           + "Name"                            = "global-common-eu-central-1-dev3"
10:05:22.718 STDOUT terraform1.10.5:           + "Namespace"                       = "common"
10:05:22.718 STDOUT terraform1.10.5:           + "Region"                          = "eu-central-1"
10:05:22.718 STDOUT terraform1.10.5:           + "Subnet"                          = "private"
10:05:22.718 STDOUT terraform1.10.5:           + "kubernetes.io/role/internal-elb" = "1"
10:05:22.718 STDOUT terraform1.10.5:           + "subnet-type"                     = "private"
10:05:22.718 STDOUT terraform1.10.5:         }
10:05:22.718 STDOUT terraform1.10.5:       + tags_all                                       = {
10:05:22.718 STDOUT terraform1.10.5:           + "Environment"                     = "global"
10:05:22.718 STDOUT terraform1.10.5:           + "Name"                            = "global-common-eu-central-1-dev3"
10:05:22.718 STDOUT terraform1.10.5:           + "Namespace"                       = "common"
10:05:22.719 STDOUT terraform1.10.5:           + "Region"                          = "eu-central-1"
10:05:22.719 STDOUT terraform1.10.5:           + "Subnet"                          = "private"
10:05:22.719 STDOUT terraform1.10.5:           + "kubernetes.io/role/internal-elb" = "1"
10:05:22.719 STDOUT terraform1.10.5:           + "subnet-type"                     = "private"
10:05:22.719 STDOUT terraform1.10.5:         }
10:05:22.719 STDOUT terraform1.10.5:       + vpc_id                                         = (known after apply)
10:05:22.719 STDOUT terraform1.10.5:     }
10:05:22.719 STDOUT terraform1.10.5:   # module.vpc.aws_subnet.private[1] will be created
10:05:22.719 STDOUT terraform1.10.5:   + resource "aws_subnet" "private" {
10:05:22.719 STDOUT terraform1.10.5:       + arn                                            = (known after apply)
10:05:22.719 STDOUT terraform1.10.5:       + assign_ipv6_address_on_creation                = false
10:05:22.719 STDOUT terraform1.10.5:       + availability_zone                              = "eu-central-1b"
10:05:22.719 STDOUT terraform1.10.5:       + availability_zone_id                           = (known after apply)
10:05:22.719 STDOUT terraform1.10.5:       + cidr_block                                     = "10.10.16.0/20"
10:05:22.720 STDOUT terraform1.10.5:       + enable_dns64                                   = false
10:05:22.720 STDOUT terraform1.10.5:       + enable_resource_name_dns_a_record_on_launch    = false
10:05:22.720 STDOUT terraform1.10.5:       + enable_resource_name_dns_aaaa_record_on_launch = false
10:05:22.720 STDOUT terraform1.10.5:       + id                                             = (known after apply)
10:05:22.720 STDOUT terraform1.10.5:       + ipv6_cidr_block_association_id                 = (known after apply)
10:05:22.720 STDOUT terraform1.10.5:       + ipv6_native                                    = false
10:05:22.720 STDOUT terraform1.10.5:       + map_public_ip_on_launch                        = false
10:05:22.720 STDOUT terraform1.10.5:       + owner_id                                       = (known after apply)
10:05:22.720 STDOUT terraform1.10.5:       + private_dns_hostname_type_on_launch            = (known after apply)
10:05:22.720 STDOUT terraform1.10.5:       + tags                                           = {
10:05:22.720 STDOUT terraform1.10.5:           + "Environment"                     = "global"
10:05:22.720 STDOUT terraform1.10.5:           + "Name"                            = "global-common-eu-central-1-dev3"
10:05:22.721 STDOUT terraform1.10.5:           + "Namespace"                       = "common"
10:05:22.721 STDOUT terraform1.10.5:           + "Region"                          = "eu-central-1"
10:05:22.721 STDOUT terraform1.10.5:           + "Subnet"                          = "private"
10:05:22.721 STDOUT terraform1.10.5:           + "kubernetes.io/role/internal-elb" = "1"
10:05:22.721 STDOUT terraform1.10.5:           + "subnet-type"                     = "private"
10:05:22.721 STDOUT terraform1.10.5:         }
10:05:22.721 STDOUT terraform1.10.5:       + tags_all                                       = {
10:05:22.721 STDOUT terraform1.10.5:           + "Environment"                     = "global"
10:05:22.721 STDOUT terraform1.10.5:           + "Name"                            = "global-common-eu-central-1-dev3"
10:05:22.721 STDOUT terraform1.10.5:           + "Namespace"                       = "common"
10:05:22.721 STDOUT terraform1.10.5:           + "Region"                          = "eu-central-1"
10:05:22.721 STDOUT terraform1.10.5:           + "Subnet"                          = "private"
10:05:22.721 STDOUT terraform1.10.5:           + "kubernetes.io/role/internal-elb" = "1"
10:05:22.722 STDOUT terraform1.10.5:           + "subnet-type"                     = "private"
10:05:22.722 STDOUT terraform1.10.5:         }
10:05:22.722 STDOUT terraform1.10.5:       + vpc_id                                         = (known after apply)
10:05:22.722 STDOUT terraform1.10.5:     }
10:05:22.722 STDOUT terraform1.10.5:   # module.vpc.aws_subnet.private[2] will be created
10:05:22.722 STDOUT terraform1.10.5:   + resource "aws_subnet" "private" {
10:05:22.722 STDOUT terraform1.10.5:       + arn                                            = (known after apply)
10:05:22.722 STDOUT terraform1.10.5:       + assign_ipv6_address_on_creation                = false
10:05:22.722 STDOUT terraform1.10.5:       + availability_zone                              = "eu-central-1c"
10:05:22.722 STDOUT terraform1.10.5:       + availability_zone_id                           = (known after apply)
10:05:22.722 STDOUT terraform1.10.5:       + cidr_block                                     = "10.10.32.0/20"
10:05:22.722 STDOUT terraform1.10.5:       + enable_dns64                                   = false
10:05:22.722 STDOUT terraform1.10.5:       + enable_resource_name_dns_a_record_on_launch    = false
10:05:22.723 STDOUT terraform1.10.5:       + enable_resource_name_dns_aaaa_record_on_launch = false
10:05:22.723 STDOUT terraform1.10.5:       + id                                             = (known after apply)
10:05:22.723 STDOUT terraform1.10.5:       + ipv6_cidr_block_association_id                 = (known after apply)
10:05:22.723 STDOUT terraform1.10.5:       + ipv6_native                                    = false
10:05:22.723 STDOUT terraform1.10.5:       + map_public_ip_on_launch                        = false
10:05:22.723 STDOUT terraform1.10.5:       + owner_id                                       = (known after apply)
10:05:22.723 STDOUT terraform1.10.5:       + private_dns_hostname_type_on_launch            = (known after apply)
10:05:22.723 STDOUT terraform1.10.5:       + tags                                           = {
10:05:22.723 STDOUT terraform1.10.5:           + "Environment"                     = "global"
10:05:22.723 STDOUT terraform1.10.5:           + "Name"                            = "global-common-eu-central-1-dev3"
10:05:22.723 STDOUT terraform1.10.5:           + "Namespace"                       = "common"
10:05:22.723 STDOUT terraform1.10.5:           + "Region"                          = "eu-central-1"
10:05:22.724 STDOUT terraform1.10.5:           + "Subnet"                          = "private"
10:05:22.724 STDOUT terraform1.10.5:           + "kubernetes.io/role/internal-elb" = "1"
10:05:22.724 STDOUT terraform1.10.5:           + "subnet-type"                     = "private"
10:05:22.724 STDOUT terraform1.10.5:         }
10:05:22.724 STDOUT terraform1.10.5:       + tags_all                                       = {
10:05:22.724 STDOUT terraform1.10.5:           + "Environment"                     = "global"
10:05:22.724 STDOUT terraform1.10.5:           + "Name"                            = "global-common-eu-central-1-dev3"
10:05:22.724 STDOUT terraform1.10.5:           + "Namespace"                       = "common"
10:05:22.724 STDOUT terraform1.10.5:           + "Region"                          = "eu-central-1"
10:05:22.724 STDOUT terraform1.10.5:           + "Subnet"                          = "private"
10:05:22.724 STDOUT terraform1.10.5:           + "kubernetes.io/role/internal-elb" = "1"
10:05:22.724 STDOUT terraform1.10.5:           + "subnet-type"                     = "private"
10:05:22.724 STDOUT terraform1.10.5:         }
10:05:22.724 STDOUT terraform1.10.5:       + vpc_id                                         = (known after apply)
10:05:22.725 STDOUT terraform1.10.5:     }
10:05:22.725 STDOUT terraform1.10.5:   # module.vpc.aws_subnet.public[0] will be created
10:05:22.725 STDOUT terraform1.10.5:   + resource "aws_subnet" "public" {
10:05:22.725 STDOUT terraform1.10.5:       + arn                                            = (known after apply)
10:05:22.725 STDOUT terraform1.10.5:       + assign_ipv6_address_on_creation                = false
10:05:22.725 STDOUT terraform1.10.5:       + availability_zone                              = "eu-central-1a"
10:05:22.725 STDOUT terraform1.10.5:       + availability_zone_id                           = (known after apply)
10:05:22.725 STDOUT terraform1.10.5:       + cidr_block                                     = "10.10.48.0/24"
10:05:22.725 STDOUT terraform1.10.5:       + enable_dns64                                   = false
10:05:22.725 STDOUT terraform1.10.5:       + enable_resource_name_dns_a_record_on_launch    = false
10:05:22.725 STDOUT terraform1.10.5:       + enable_resource_name_dns_aaaa_record_on_launch = false
10:05:22.725 STDOUT terraform1.10.5:       + id                                             = (known after apply)
10:05:22.725 STDOUT terraform1.10.5:       + ipv6_cidr_block_association_id                 = (known after apply)
10:05:22.726 STDOUT terraform1.10.5:       + ipv6_native                                    = false
10:05:22.726 STDOUT terraform1.10.5:       + map_public_ip_on_launch                        = false
10:05:22.726 STDOUT terraform1.10.5:       + owner_id                                       = (known after apply)
10:05:22.726 STDOUT terraform1.10.5:       + private_dns_hostname_type_on_launch            = (known after apply)
10:05:22.726 STDOUT terraform1.10.5:       + tags                                           = {
10:05:22.726 STDOUT terraform1.10.5:           + "Environment"            = "global"
10:05:22.726 STDOUT terraform1.10.5:           + "Name"                   = "global-common-eu-central-1-dev3"
10:05:22.726 STDOUT terraform1.10.5:           + "Namespace"              = "common"
10:05:22.726 STDOUT terraform1.10.5:           + "Region"                 = "eu-central-1"
10:05:22.726 STDOUT terraform1.10.5:           + "Subnet"                 = "public"
10:05:22.726 STDOUT terraform1.10.5:           + "kubernetes.io/role/elb" = "1"
10:05:22.726 STDOUT terraform1.10.5:           + "subnet-type"            = "public"
10:05:22.726 STDOUT terraform1.10.5:         }
10:05:22.726 STDOUT terraform1.10.5:       + tags_all                                       = {
10:05:22.727 STDOUT terraform1.10.5:           + "Environment"            = "global"
10:05:22.727 STDOUT terraform1.10.5:           + "Name"                   = "global-common-eu-central-1-dev3"
10:05:22.727 STDOUT terraform1.10.5:           + "Namespace"              = "common"
10:05:22.727 STDOUT terraform1.10.5:           + "Region"                 = "eu-central-1"
10:05:22.727 STDOUT terraform1.10.5:           + "Subnet"                 = "public"
10:05:22.727 STDOUT terraform1.10.5:           + "kubernetes.io/role/elb" = "1"
10:05:22.727 STDOUT terraform1.10.5:           + "subnet-type"            = "public"
10:05:22.727 STDOUT terraform1.10.5:         }
10:05:22.727 STDOUT terraform1.10.5:       + vpc_id                                         = (known after apply)
10:05:22.727 STDOUT terraform1.10.5:     }
10:05:22.727 STDOUT terraform1.10.5:   # module.vpc.aws_subnet.public[1] will be created
10:05:22.727 STDOUT terraform1.10.5:   + resource "aws_subnet" "public" {
10:05:22.727 STDOUT terraform1.10.5:       + arn                                            = (known after apply)
10:05:22.727 STDOUT terraform1.10.5:       + assign_ipv6_address_on_creation                = false
10:05:22.728 STDOUT terraform1.10.5:       + availability_zone                              = "eu-central-1b"
10:05:22.728 STDOUT terraform1.10.5:       + availability_zone_id                           = (known after apply)
10:05:22.728 STDOUT terraform1.10.5:       + cidr_block                                     = "10.10.49.0/24"
10:05:22.728 STDOUT terraform1.10.5:       + enable_dns64                                   = false
10:05:22.728 STDOUT terraform1.10.5:       + enable_resource_name_dns_a_record_on_launch    = false
10:05:22.728 STDOUT terraform1.10.5:       + enable_resource_name_dns_aaaa_record_on_launch = false
10:05:22.728 STDOUT terraform1.10.5:       + id                                             = (known after apply)
10:05:22.728 STDOUT terraform1.10.5:       + ipv6_cidr_block_association_id                 = (known after apply)
10:05:22.728 STDOUT terraform1.10.5:       + ipv6_native                                    = false
10:05:22.728 STDOUT terraform1.10.5:       + map_public_ip_on_launch                        = false
10:05:22.728 STDOUT terraform1.10.5:       + owner_id                                       = (known after apply)
10:05:22.728 STDOUT terraform1.10.5:       + private_dns_hostname_type_on_launch            = (known after apply)
10:05:22.729 STDOUT terraform1.10.5:       + tags                                           = {
10:05:22.729 STDOUT terraform1.10.5:           + "Environment"            = "global"
10:05:22.729 STDOUT terraform1.10.5:           + "Name"                   = "global-common-eu-central-1-dev3"
10:05:22.729 STDOUT terraform1.10.5:           + "Namespace"              = "common"
10:05:22.729 STDOUT terraform1.10.5:           + "Region"                 = "eu-central-1"
10:05:22.729 STDOUT terraform1.10.5:           + "Subnet"                 = "public"
10:05:22.729 STDOUT terraform1.10.5:           + "kubernetes.io/role/elb" = "1"
10:05:22.729 STDOUT terraform1.10.5:           + "subnet-type"            = "public"
10:05:22.729 STDOUT terraform1.10.5:         }
10:05:22.729 STDOUT terraform1.10.5:       + tags_all                                       = {
10:05:22.729 STDOUT terraform1.10.5:           + "Environment"            = "global"
10:05:22.729 STDOUT terraform1.10.5:           + "Name"                   = "global-common-eu-central-1-dev3"
10:05:22.729 STDOUT terraform1.10.5:           + "Namespace"              = "common"
10:05:22.730 STDOUT terraform1.10.5:           + "Region"                 = "eu-central-1"
10:05:22.730 STDOUT terraform1.10.5:           + "Subnet"                 = "public"
10:05:22.730 STDOUT terraform1.10.5:           + "kubernetes.io/role/elb" = "1"
10:05:22.730 STDOUT terraform1.10.5:           + "subnet-type"            = "public"
10:05:22.730 STDOUT terraform1.10.5:         }
10:05:22.730 STDOUT terraform1.10.5:       + vpc_id                                         = (known after apply)
10:05:22.730 STDOUT terraform1.10.5:     }
10:05:22.730 STDOUT terraform1.10.5:   # module.vpc.aws_subnet.public[2] will be created
10:05:22.730 STDOUT terraform1.10.5:   + resource "aws_subnet" "public" {
10:05:22.730 STDOUT terraform1.10.5:       + arn                                            = (known after apply)
10:05:22.730 STDOUT terraform1.10.5:       + assign_ipv6_address_on_creation                = false
10:05:22.730 STDOUT terraform1.10.5:       + availability_zone                              = "eu-central-1c"
10:05:22.730 STDOUT terraform1.10.5:       + availability_zone_id                           = (known after apply)
10:05:22.730 STDOUT terraform1.10.5:       + cidr_block                                     = "10.10.50.0/24"
10:05:22.730 STDOUT terraform1.10.5:       + enable_dns64                                   = false
10:05:22.731 STDOUT terraform1.10.5:       + enable_resource_name_dns_a_record_on_launch    = false
10:05:22.731 STDOUT terraform1.10.5:       + enable_resource_name_dns_aaaa_record_on_launch = false
10:05:22.731 STDOUT terraform1.10.5:       + id                                             = (known after apply)
10:05:22.731 STDOUT terraform1.10.5:       + ipv6_cidr_block_association_id                 = (known after apply)
10:05:22.731 STDOUT terraform1.10.5:       + ipv6_native                                    = false
10:05:22.731 STDOUT terraform1.10.5:       + map_public_ip_on_launch                        = false
10:05:22.731 STDOUT terraform1.10.5:       + owner_id                                       = (known after apply)
10:05:22.731 STDOUT terraform1.10.5:       + private_dns_hostname_type_on_launch            = (known after apply)
10:05:22.731 STDOUT terraform1.10.5:       + tags                                           = {
10:05:22.731 STDOUT terraform1.10.5:           + "Environment"            = "global"
10:05:22.731 STDOUT terraform1.10.5:           + "Name"                   = "global-common-eu-central-1-dev3"
10:05:22.731 STDOUT terraform1.10.5:           + "Namespace"              = "common"
10:05:22.732 STDOUT terraform1.10.5:           + "Region"                 = "eu-central-1"
10:05:22.732 STDOUT terraform1.10.5:           + "Subnet"                 = "public"
10:05:22.732 STDOUT terraform1.10.5:           + "kubernetes.io/role/elb" = "1"
10:05:22.732 STDOUT terraform1.10.5:           + "subnet-type"            = "public"
10:05:22.732 STDOUT terraform1.10.5:         }
10:05:22.732 STDOUT terraform1.10.5:       + tags_all                                       = {
10:05:22.732 STDOUT terraform1.10.5:           + "Environment"            = "global"
10:05:22.732 STDOUT terraform1.10.5:           + "Name"                   = "global-common-eu-central-1-dev3"
10:05:22.732 STDOUT terraform1.10.5:           + "Namespace"              = "common"
10:05:22.732 STDOUT terraform1.10.5:           + "Region"                 = "eu-central-1"
10:05:22.732 STDOUT terraform1.10.5:           + "Subnet"                 = "public"
10:05:22.732 STDOUT terraform1.10.5:           + "kubernetes.io/role/elb" = "1"
10:05:22.733 STDOUT terraform1.10.5:           + "subnet-type"            = "public"
10:05:22.733 STDOUT terraform1.10.5:         }
10:05:22.733 STDOUT terraform1.10.5:       + vpc_id                                         = (known after apply)
10:05:22.733 STDOUT terraform1.10.5:     }
10:05:22.733 STDOUT terraform1.10.5:   # module.vpc.aws_vpc.this[0] will be created
10:05:22.733 STDOUT terraform1.10.5:   + resource "aws_vpc" "this" {
10:05:22.733 STDOUT terraform1.10.5:       + arn                                  = (known after apply)
10:05:22.733 STDOUT terraform1.10.5:       + cidr_block                           = "10.10.0.0/16"
10:05:22.733 STDOUT terraform1.10.5:       + default_network_acl_id               = (known after apply)
10:05:22.733 STDOUT terraform1.10.5:       + default_route_table_id               = (known after apply)
10:05:22.733 STDOUT terraform1.10.5:       + default_security_group_id            = (known after apply)
10:05:22.733 STDOUT terraform1.10.5:       + dhcp_options_id                      = (known after apply)
10:05:22.733 STDOUT terraform1.10.5:       + enable_dns_hostnames                 = true
10:05:22.733 STDOUT terraform1.10.5:       + enable_dns_support                   = true
10:05:22.734 STDOUT terraform1.10.5:       + enable_network_address_usage_metrics = (known after apply)
10:05:22.734 STDOUT terraform1.10.5:       + id                                   = (known after apply)
10:05:22.734 STDOUT terraform1.10.5:       + instance_tenancy                     = "default"
10:05:22.734 STDOUT terraform1.10.5:       + ipv6_association_id                  = (known after apply)
10:05:22.734 STDOUT terraform1.10.5:       + ipv6_cidr_block                      = (known after apply)
10:05:22.734 STDOUT terraform1.10.5:       + ipv6_cidr_block_network_border_group = (known after apply)
10:05:22.734 STDOUT terraform1.10.5:       + main_route_table_id                  = (known after apply)
10:05:22.734 STDOUT terraform1.10.5:       + owner_id                             = (known after apply)
10:05:22.734 STDOUT terraform1.10.5:       + tags                                 = {
10:05:22.734 STDOUT terraform1.10.5:           + "Environment" = "global"
10:05:22.734 STDOUT terraform1.10.5:           + "Name"        = "global-common-eu-central-1-dev3"
10:05:22.734 STDOUT terraform1.10.5:           + "Namespace"   = "common"
10:05:22.734 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
10:05:22.734 STDOUT terraform1.10.5:         }
10:05:22.734 STDOUT terraform1.10.5:       + tags_all                             = {
10:05:22.735 STDOUT terraform1.10.5:           + "Environment" = "global"
10:05:22.735 STDOUT terraform1.10.5:           + "Name"        = "global-common-eu-central-1-dev3"
10:05:22.735 STDOUT terraform1.10.5:           + "Namespace"   = "common"
10:05:22.735 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
10:05:22.735 STDOUT terraform1.10.5:         }
10:05:22.735 STDOUT terraform1.10.5:     }
10:05:22.735 STDOUT terraform1.10.5: Plan: 23 to add, 0 to change, 0 to destroy.
10:05:22.735 STDOUT terraform1.10.5: 
10:05:22.735 STDOUT terraform1.10.5: Changes to Outputs:
10:05:22.735 STDOUT terraform1.10.5:   + account_id      = "052701461513"
10:05:22.735 STDOUT terraform1.10.5:   + private_subnets = [
10:05:22.735 STDOUT terraform1.10.5:       + (known after apply),
10:05:22.735 STDOUT terraform1.10.5:       + (known after apply),
10:05:22.735 STDOUT terraform1.10.5:       + (known after apply),
10:05:22.735 STDOUT terraform1.10.5:     ]
10:05:22.735 STDOUT terraform1.10.5:   + public_subnets  = [
10:05:22.735 STDOUT terraform1.10.5:       + (known after apply),
10:05:22.735 STDOUT terraform1.10.5:       + (known after apply),
10:05:22.735 STDOUT terraform1.10.5:       + (known after apply),
10:05:22.735 STDOUT terraform1.10.5:     ]
10:05:22.735 STDOUT terraform1.10.5:   + vpc_cidr_block  = "10.10.0.0/16"
10:05:22.735 STDOUT terraform1.10.5:   + vpc_id          = (known after apply)
10:05:22.735 STDOUT terraform1.10.5:   + vpc_name        = "global-common-eu-central-1-dev3"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d devops-dev/global/eu-central-1/common/vpc/dev3 -w devops-dev_global_eu-central-1_common_vpc_dev3
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://global-common-eu-central-1-atlantis.skeleton-dev.testenv.io/lock?id=cryptocat-org%252Fdevops-digger%252Fdevops-dev%252Fglobal%252Feu-central-1%252Fcommon%252Fvpc%252Fdev3%252Fdevops-dev_global_eu-central-1_common_vpc_dev3)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d devops-dev/global/eu-central-1/common/vpc/dev3 -w devops-dev_global_eu-central-1_common_vpc_dev3
  ```
Plan: 23 to add, 0 to change, 0 to destroy.

---
### Plan Summary

2 projects, 2 with changes, 0 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```